// Найдите количество секунд в сутках.
document.write('Количество секунд в сутках: <b>' + 60 * 60 * 24 + '</b> секунды. <br>');

// Найдите количество секунд в 30 сутках.
document.write('Количество секунд в 30 сутках: <b>' + 60 * 60 * 24 * 30 + '</b> секунды.<br>');

// Найдите количество секунд в году.
document.write('Количество секунд в году: <b>' + 60 * 60 * 24 * 365 + '</b> секунды.<br>');

// Найдите количество минут в сутках.
document.write('Количество минут в сутках: <b>' + 60 * 24 + '</b> минут.<br>');

// Найдите количество минут в году.
document.write('Количество минут в году: <b>' + 60 * 24 * 365 + '</b> минут.<br>');

// Найдите количество байт в мегабайте.
document.write('Количество байт в мегабайте: <b>' + 1 * 1024 * 1024 + '</b> байт.<br>');

// Найдите количество байт в гигабайте.
document.write('Количество байт в мегабайте: <b>' + 1 * 1024 * 1024 * 1024 + '</b> байт.<br>');