<?
// Содержимое массива
// Создайте массив с элементами 'a', 'b' и 'c'.
// Выведите его на экран с помощью команды echo и с помощью функции var_dump.
// $arr = ['a', 'b', 'c'];
// var_dump($arr);


// Ассоциативные массивы
// Создайте массив с ключами 1, 2 и 3 и значениями 'a', 'b' и 'c'. Выведите на экран все его элементы.
// $arr = [
//     1 => 'a',
//     2 => 'b',
//     3 => 'c',
// ];
// var_dump($arr);


// Строковые ключи
// Создайте массив $user с ключами 'name', 'surname', 'patronymic'
// и какими-то произвольными значениями. Выведите на экран фамилию, имя и отчество через пробел.
// $user = [
//     'name' => 'Никита',
//     'surname' => 'Капурин',
//     'patronymic' => 'Вячеславович',
// ];
// var_dump($user);


// Длина массива
// $arr = ['a', 'b', 'c', 'd'];
// echo count($arr);


// Последний элемент массива
// $arr = ['a', 'b', 'c', 'd'];
// echo $arr[count($arr) - 1];


// Перезапись элементов массива
// Прибавьте к каждому элементу массива число 3. Выведите на экран измененный массив.
// $arr = ['a' => 1, 'b' => 2, 'c' => 3];
// $arr['a'] += 3;
// $arr['b'] += 3;
// $arr['c'] += 3;
// var_dump($arr);


// Заполнение массивов
// Добавьте ему в конец элементы 4 и 5.
// $arr = [1, 2, 3];
// $arr[] = 4;
// $arr[] = 5;
// var_dump($arr);