const PI = 3.14;

// Пусть дана переменная r с радиусом круга.
// По соответствующей формуле найдите площадь круга и запишите ее в переменную s.
// Выведите содержимое этой переменной на экран.
// let r = 4;
// let s = PI * (r**2);
// document.write(s);


// Пусть дана переменная a со стороной квадрата.
// Найдите площадь квадрата и запишите ее в переменную s.
// Выведите содержимое этой переменной на экран.
// let a = 4;
// let s = a * a;
// document.write(s);


// Пусть даны переменные a и b со сторонами прямоугольника.
// Найдите площадь прямоугольника и запишите ее в переменную s.
// Выведите содержимое этой переменной на экран.
// let a = 3;
// let b = 8;
// let s = a * b;
// document.write(s);


// Пусть даны переменные a и b со сторонами прямоугольника.
// Найдите периметр прямоугольника и запишите его в переменную p.
// Выведите содержимое этой переменной на экран.
// let a = 4;
// let b = 6;
// let p = a * 2 + b * 2; 
// document.write(p);


// Пусть дана переменная tc с температурой в градусах Цельсия.
// По соответствующей формуле выполните перевод этой температуры в градусы Фаренгейта.
// let tc = 34;
// let fa = tc * 1.8 + 32;
// document.write(fa);