// -- Объекты 
// Создайте объект с ключами от 1 до 7, в качестве значений содержащий имена дней недели. Выведите на экран все его элементы.
// let obj = {
//     1 : 'Понедельник',
//     2 : 'Вторник',
//     3 : 'Среда',
//     4 : 'Четверг',
//     5 : 'Пятница',
//     6 : 'Суббота',
//     7 : 'Воскресенье'
// }
// console.log(obj);


// -- Строковые ключи объектов
// Создайте объект user с ключами 'name', 'surname', 'patronymic' и какими-то произвольными значениями.
// Выведите на экран фамилию, имя и отчество через пробел.
// let obj = {
//     'name' : 'Nikit',
//     'surname' : 'Kapurin',
//     'patronymic': 'Vacheslavovich'
// }
// document.write(obj['name'] + " " + obj['surname'] + " " + obj['patronymic']);


// -- Свойства объектов
// Создайте объект date с ключами 'year', 'month' и 'day' и значениями, соответствующими текущему дню.
// Выведите созданную дату на экран в формате год-месяц-день.
// let date = {
//     year : '2023',
//     month : '11',
//     day : '06'
// }
// document.write(date.year + '-' + date.month + '-' + date.day);


// -- Изменение элементов объектов
// Возведите в квадрат каждый элемент этого объекта.
// let obj = {x : 1, y : 2, z : 3};
// obj.x *= 2;
// obj.y *= 2;
// obj.z *= 2;
// console.log (obj);


// -- Добавление элементов в объекты
// Создайте пустой объект, а затем заполните его значениями.
// let obj = {};
// obj.a = 1;
// obj.b = 2;
// obj.c = 3;
// console.log(obj);


// -- Массив ключей объекта
// Получите массив ключей следующего объекта:
// let obj = {x: 1, y: 2, z: 3};
// let key = Object.keys(obj);
// console.log(key);


// -- Длина объекта
// Найдите количество элементов в следующем объекте:
// let obj = {x: 1, y: 2, z: 3};
// console.log(Object.keys(obj).length);
