// -- Массивы
// Создайте массив с числами.
// Выведите его на экран с помощью функции alert,
// а также выведите его в консоль с помощью console.log.
// let arr = [1, 2, 3, 4, 5];
// alert(arr);
// console.log(arr);

// Создайте массив со строками.
// Выведите его на экран с помощью функции alert,
// а также выведите его в консоль с помощью console.log.
// let arr = ['a', 'b', 'c'];
// alert(arr);
// console.log(arr);


// -- Получение элементов массивов
// Создайте массив с элементами 1, 2, 3.
// Выведите на экран каждый из этих элементов.
// let arr = [1, 2, 3];
// console.log(arr[0]);
// console.log(arr[1]);
// console.log(arr[2]);

// Выведите на экран сумму элементов этого массива
// let arr = [1, 2, 3];
// console.log(arr[0] + arr[1] + arr[2]);


// -- Длина массива
// Создайте массив с произвольными элементами.
// Выведите на экран количество элементов в этом массиве.
// let arr = [1, 2, 3, 4, 5];
// document.write(arr.length)

// Создайте массив с произвольными элементами.
// Выведите на экран последний элемент этого массива.
// let arr = [1, 2, 3, 4, 5];
// document.write(arr[arr.length - 1]);


// -- Изменение элементов массива
// Создайте массив с элементами 'a', 'b', 'c'.
// Запишите вместо первого элемента число 1, вместо второго - 2, вместо третьего - 3.
// let arr = ['a', 'b', 'c'];
// arr[0] = 1;
// arr[1] = 2;
// arr[2] = 3;
// document.write(arr);


// -- Перезапись элементов массива
// Создайте массив с числами.
// Прибавьте к каждому элементу массива число 3.
// Выведите на экран измененный массив.
// let arr = [1, 2, 3];
// arr[0] += 3;
// arr[1] += 3;
// arr[2] += 3;
// document.write(arr);


// -- Инкремент и декремент элементов массива
// Создайте массив с элементами 1, 2 и 3.
// С помощью оператора ++ увеличьте каждый элемент массива на единицу.
// let arr = [1, 2, 3];
// arr[0]++;
// arr[1]++;
// arr[2]++;
// document.write(arr);


// -- Добавление элементов по ключам
// С помощью описанного приема создайте массив с элементами 1, 2 и 3.
// let arr = [];
// arr[0] = 1;
// arr[1] = 2;
// arr[2] = 3;
// document.write(arr);
// Добавьте ему в конец элементы 4 и 5.
// arr[3] = 4;
// arr[4] = 5;
// document.write(arr);


// -- Добавление элементов через push
// Заполните массив числами 1, 2 и 3.
// let arr = [];
// arr.push(1);
// arr.push(2);
// arr.push(3);


// -- Оператор delete в массивах
// Удалите из него два элемента.
// Проверьте, какое станет значение свойства length после этого.
// let arr = ['a', 'b', 'c', 'd', 'e'];
// delete arr[1];
// delete arr[0];
// console.log(arr.length);
// console.log(arr);